database/mysql-binlog.org
#+TITLE: MySQL 主从同步
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2021-07-03 Sat 14:50:35>
#+HTML_LINK_UP: ../readme.html
#+HTML_LINK_HOME: ../index.html
#+SETUPFILE: ~/.emacs.d/site-lisp/org-html-themes/setup/theme-readtheorg-local.setup
#+PROPERTY: header-args:sql :dbhost 127.0.0.1 :database test01 :engine mysql :dbuser user01 :dbpassword user01 :dbport 3306 :exports both
#+OPTIONS: ^:nil


* binlog 简介
  binlog,即二进制日志,它记录了数据库上的所有改变. 改变数据库的 SQL 语句执行结束
  时,将在 binlog 的末尾写入一条记录,同时通知语句解析器,语句执行完毕.

  binlog 格式
  - 基于语句, 无法保证所有语句都在从库执行成功, 比如 ~update ... limit 1~
  - 基于行, 将每一次改动记为 binlog 中的一行.在执行一个特别复杂的 update 或者
    delete 操作时,基于行的格式会有优势.

* 查看 binlog event
  获取所有 binlog 文件列表
  #+BEGIN_SRC sql
    show binary logs;
  #+END_SRC

  #+RESULTS:
  | Log_name      | File_size |
  |---------------+-----------|
  | binlog.000001 |      6370 |
  | binlog.000002 |       177 |
  | binlog.000003 |       177 |
  | binlog.000004 |       177 |
  | binlog.000005 |       177 |
  | binlog.000006 |       177 |
  | binlog.000007 |       177 |
  | binlog.000008 |       177 |
  | binlog.000009 |       177 |
  | binlog.000010 |       177 |
  | binlog.000011 |     21668 |
  | binlog.000012 |       177 |
  | binlog.000013 |      3367 |
  | binlog.000014 |     31076 |

  查看当前正在写入的 binlog
  #+BEGIN_SRC sql
    show master status;
  #+END_SRC

  #+RESULTS:
  | File          | Position | Binlog_Do_DB | Binlog_Ignore_DB | Executed_Gtid_Set |
  |---------------+----------+--------------+------------------+-------------------|
  | binlog.000014 |    31076 |              |                  |                   |

  查看第一个 binlog 的内容
  #+BEGIN_SRC sql
    show binlog events limit 20;
  #+END_SRC

  #+RESULTS:
  | Log_name      |  Pos | Event_type     | Server_id | End_log_pos | Info                                                                                             |
  |---------------+------+----------------+-----------+-------------+--------------------------------------------------------------------------------------------------|
  | binlog.000001 |    4 | Format_desc    |         1 |         123 | Server ver: 5.7.31-log, Binlog ver: 4                                                            |
  | binlog.000001 |  123 | Previous_gtids |         1 |         154 |                                                                                                  |
  | binlog.000001 |  154 | Anonymous_Gtid |         1 |         219 | SET @@SESSION.GTID_NEXT= 'ANONYMOUS'                                                             |
  | binlog.000001 |  219 | Query          |         1 |         319 | create database test01                                                                           |
  | binlog.000001 |  319 | Anonymous_Gtid |         1 |         384 | SET @@SESSION.GTID_NEXT= 'ANONYMOUS'                                                             |
  | binlog.000001 |  384 | Query          |         1 |         517 | use `test01`; create table t1 (id int primary key, name varchar(32) )                            |
  | binlog.000001 |  517 | Anonymous_Gtid |         1 |         582 | SET @@SESSION.GTID_NEXT= 'ANONYMOUS'                                                             |
  | binlog.000001 |  582 | Query          |         1 |         701 | use `test01`; DROP TABLE `t1` /* generated by server */                                          |
  | binlog.000001 |  701 | Anonymous_Gtid |         1 |         766 | SET @@SESSION.GTID_NEXT= 'ANONYMOUS'                                                             |
  | binlog.000001 |  766 | Query          |         1 |         926 | use `test01`; create table table01(id int not null auto_increment primary key, name varchar(64)) |
  | binlog.000001 |  926 | Anonymous_Gtid |         1 |         991 | SET @@SESSION.GTID_NEXT= 'ANONYMOUS'                                                             |
  | binlog.000001 |  991 | Query          |         1 |        1065 | BEGIN                                                                                            |
  | binlog.000001 | 1065 | Table_map      |         1 |        1120 | table_id: 221 (test01.table01)                                                                   |
  | binlog.000001 | 1120 | Write_rows     |         1 |        1168 | table_id: 221 flags: STMT_END_F                                                                  |
  | binlog.000001 | 1168 | Table_map      |         1 |        1223 | table_id: 221 (test01.table01)                                                                   |
  | binlog.000001 | 1223 | Write_rows     |         1 |        1271 | table_id: 221 flags: STMT_END_F                                                                  |
  | binlog.000001 | 1271 | Table_map      |         1 |        1326 | table_id: 221 (test01.table01)                                                                   |
  | binlog.000001 | 1326 | Write_rows     |         1 |        1375 | table_id: 221 flags: STMT_END_F                                                                  |
  | binlog.000001 | 1375 | Table_map      |         1 |        1430 | table_id: 221 (test01.table01)                                                                   |
  | binlog.000001 | 1430 | Update_rows    |         1 |        1495 | table_id: 221 flags: STMT_END_F                                                                  |

  查看指定 binlog 内容
  #+BEGIN_SRC sql
    show binlog events in 'binlog.000014' limit 10;
  #+END_SRC

  #+RESULTS:
  | Log_name      | Pos | Event_type     | Server_id | End_log_pos | Info                                                                                                                                          |
  |---------------+-----+----------------+-----------+-------------+-----------------------------------------------------------------------------------------------------------------------------------------------|
  | binlog.000014 |   4 | Format_desc    |         1 |         123 | Server ver: 5.7.31-log, Binlog ver: 4                                                                                                         |
  | binlog.000014 | 123 | Previous_gtids |         1 |         154 |                                                                                                                                               |
  | binlog.000014 | 154 | Anonymous_Gtid |         1 |         219 | SET @@SESSION.GTID_NEXT= 'ANONYMOUS'                                                                                                          |
  | binlog.000014 | 219 | Query          |         1 |         419 | use `test01`; create table author (\n  id int auto_increment primary key,\n  name varchar(128) not null,\n  age int,\n  gender varchar(32)\n) |
  | binlog.000014 | 419 | Anonymous_Gtid |         1 |         484 | SET @@SESSION.GTID_NEXT= 'ANONYMOUS'                                                                                                          |
  | binlog.000014 | 484 | Query          |         1 |         558 | BEGIN                                                                                                                                         |
  | binlog.000014 | 558 | Table_map      |         1 |         616 | table_id: 112 (test01.author)                                                                                                                 |
  | binlog.000014 | 616 | Write_rows     |         1 |         667 | table_id: 112 flags: STMT_END_F                                                                                                               |
  | binlog.000014 | 667 | Xid            |         1 |         698 | COMMIT /* xid=13 */                                                                                                                           |
  | binlog.000014 | 698 | Anonymous_Gtid |         1 |         763 | SET @@SESSION.GTID_NEXT= 'ANONYMOUS'                                                                                                          |
