database/mysql-binlog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-03 Sat 15:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MySQL 主从同步</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">MySQL 主从同步</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc4f690f">1. binlog 简介</a></li>
<li><a href="#orga02e3e0">2. 查看 binlog event</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgc4f690f" class="outline-2">
<h2 id="orgc4f690f"><span class="section-number-2">1</span> binlog 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
binlog,即二进制日志,它记录了数据库上的所有改变. 改变数据库的 SQL 语句执行结束
时,将在 binlog 的末尾写入一条记录,同时通知语句解析器,语句执行完毕.
</p>

<p>
binlog 格式
</p>
<ul class="org-ul">
<li>基于语句, 无法保证所有语句都在从库执行成功, 比如 <code>update ... limit 1</code></li>
<li>基于行, 将每一次改动记为 binlog 中的一行.在执行一个特别复杂的 update 或者
delete 操作时,基于行的格式会有优势.</li>
</ul>
</div>
</div>

<div id="outline-container-orga02e3e0" class="outline-2">
<h2 id="orga02e3e0"><span class="section-number-2">2</span> 查看 binlog event</h2>
<div class="outline-text-2" id="text-2">
<p>
获取所有 binlog 文件列表
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">show</span> <span style="color: #268bd2;">binary</span> logs;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Log_name</th>
<th scope="col" class="org-right">File_size</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">6370</td>
</tr>

<tr>
<td class="org-left">binlog.000002</td>
<td class="org-right">177</td>
</tr>

<tr>
<td class="org-left">binlog.000003</td>
<td class="org-right">177</td>
</tr>

<tr>
<td class="org-left">binlog.000004</td>
<td class="org-right">177</td>
</tr>

<tr>
<td class="org-left">binlog.000005</td>
<td class="org-right">177</td>
</tr>

<tr>
<td class="org-left">binlog.000006</td>
<td class="org-right">177</td>
</tr>

<tr>
<td class="org-left">binlog.000007</td>
<td class="org-right">177</td>
</tr>

<tr>
<td class="org-left">binlog.000008</td>
<td class="org-right">177</td>
</tr>

<tr>
<td class="org-left">binlog.000009</td>
<td class="org-right">177</td>
</tr>

<tr>
<td class="org-left">binlog.000010</td>
<td class="org-right">177</td>
</tr>

<tr>
<td class="org-left">binlog.000011</td>
<td class="org-right">21668</td>
</tr>

<tr>
<td class="org-left">binlog.000012</td>
<td class="org-right">177</td>
</tr>

<tr>
<td class="org-left">binlog.000013</td>
<td class="org-right">3367</td>
</tr>

<tr>
<td class="org-left">binlog.000014</td>
<td class="org-right">31076</td>
</tr>
</tbody>
</table>

<p>
查看当前正在写入的 binlog
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">show</span> master status;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">File</th>
<th scope="col" class="org-right">Position</th>
<th scope="col" class="org-left">Binlog_Do_DB</th>
<th scope="col" class="org-left">Binlog_Ignore_DB</th>
<th scope="col" class="org-left">Executed_Gtid_Set</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">binlog.000014</td>
<td class="org-right">31076</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
查看第一个 binlog 的内容
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">show</span> binlog events <span style="color: #859900;">limit</span> 20;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Log_name</th>
<th scope="col" class="org-right">Pos</th>
<th scope="col" class="org-left">Event_type</th>
<th scope="col" class="org-right">Server_id</th>
<th scope="col" class="org-right">End_log_pos</th>
<th scope="col" class="org-left">Info</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">4</td>
<td class="org-left">Format_desc</td>
<td class="org-right">1</td>
<td class="org-right">123</td>
<td class="org-left">Server ver: 5.7.31-log, Binlog ver: 4</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">123</td>
<td class="org-left">Previous_gtids</td>
<td class="org-right">1</td>
<td class="org-right">154</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">154</td>
<td class="org-left">Anonymous_Gtid</td>
<td class="org-right">1</td>
<td class="org-right">219</td>
<td class="org-left">SET @@SESSION.GTID_NEXT= 'ANONYMOUS'</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">219</td>
<td class="org-left">Query</td>
<td class="org-right">1</td>
<td class="org-right">319</td>
<td class="org-left">create database test01</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">319</td>
<td class="org-left">Anonymous_Gtid</td>
<td class="org-right">1</td>
<td class="org-right">384</td>
<td class="org-left">SET @@SESSION.GTID_NEXT= 'ANONYMOUS'</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">384</td>
<td class="org-left">Query</td>
<td class="org-right">1</td>
<td class="org-right">517</td>
<td class="org-left">use `test01`; create table t1 (id int primary key, name varchar(32) )</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">517</td>
<td class="org-left">Anonymous_Gtid</td>
<td class="org-right">1</td>
<td class="org-right">582</td>
<td class="org-left">SET @@SESSION.GTID_NEXT= 'ANONYMOUS'</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">582</td>
<td class="org-left">Query</td>
<td class="org-right">1</td>
<td class="org-right">701</td>
<td class="org-left">use `test01`; DROP TABLE `t1` <i>* generated by server *</i></td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">701</td>
<td class="org-left">Anonymous_Gtid</td>
<td class="org-right">1</td>
<td class="org-right">766</td>
<td class="org-left">SET @@SESSION.GTID_NEXT= 'ANONYMOUS'</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">766</td>
<td class="org-left">Query</td>
<td class="org-right">1</td>
<td class="org-right">926</td>
<td class="org-left">use `test01`; create table table01(id int not null auto_increment primary key, name varchar(64))</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">926</td>
<td class="org-left">Anonymous_Gtid</td>
<td class="org-right">1</td>
<td class="org-right">991</td>
<td class="org-left">SET @@SESSION.GTID_NEXT= 'ANONYMOUS'</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">991</td>
<td class="org-left">Query</td>
<td class="org-right">1</td>
<td class="org-right">1065</td>
<td class="org-left">BEGIN</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">1065</td>
<td class="org-left">Table_map</td>
<td class="org-right">1</td>
<td class="org-right">1120</td>
<td class="org-left">table_id: 221 (test01.table01)</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">1120</td>
<td class="org-left">Write_rows</td>
<td class="org-right">1</td>
<td class="org-right">1168</td>
<td class="org-left">table_id: 221 flags: STMT_END_F</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">1168</td>
<td class="org-left">Table_map</td>
<td class="org-right">1</td>
<td class="org-right">1223</td>
<td class="org-left">table_id: 221 (test01.table01)</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">1223</td>
<td class="org-left">Write_rows</td>
<td class="org-right">1</td>
<td class="org-right">1271</td>
<td class="org-left">table_id: 221 flags: STMT_END_F</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">1271</td>
<td class="org-left">Table_map</td>
<td class="org-right">1</td>
<td class="org-right">1326</td>
<td class="org-left">table_id: 221 (test01.table01)</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">1326</td>
<td class="org-left">Write_rows</td>
<td class="org-right">1</td>
<td class="org-right">1375</td>
<td class="org-left">table_id: 221 flags: STMT_END_F</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">1375</td>
<td class="org-left">Table_map</td>
<td class="org-right">1</td>
<td class="org-right">1430</td>
<td class="org-left">table_id: 221 (test01.table01)</td>
</tr>

<tr>
<td class="org-left">binlog.000001</td>
<td class="org-right">1430</td>
<td class="org-left">Update_rows</td>
<td class="org-right">1</td>
<td class="org-right">1495</td>
<td class="org-left">table_id: 221 flags: STMT_END_F</td>
</tr>
</tbody>
</table>

<p>
查看指定 binlog 内容
</p>
<div class="org-src-container">
<pre class="src src-sql"><span style="color: #859900;">show</span> binlog events <span style="color: #859900;">in</span> <span style="color: #2aa198;">'binlog.000014'</span> <span style="color: #859900;">limit</span> 10;
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Log_name</th>
<th scope="col" class="org-right">Pos</th>
<th scope="col" class="org-left">Event_type</th>
<th scope="col" class="org-right">Server_id</th>
<th scope="col" class="org-right">End_log_pos</th>
<th scope="col" class="org-left">Info</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">binlog.000014</td>
<td class="org-right">4</td>
<td class="org-left">Format_desc</td>
<td class="org-right">1</td>
<td class="org-right">123</td>
<td class="org-left">Server ver: 5.7.31-log, Binlog ver: 4</td>
</tr>

<tr>
<td class="org-left">binlog.000014</td>
<td class="org-right">123</td>
<td class="org-left">Previous_gtids</td>
<td class="org-right">1</td>
<td class="org-right">154</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">binlog.000014</td>
<td class="org-right">154</td>
<td class="org-left">Anonymous_Gtid</td>
<td class="org-right">1</td>
<td class="org-right">219</td>
<td class="org-left">SET @@SESSION.GTID_NEXT= 'ANONYMOUS'</td>
</tr>

<tr>
<td class="org-left">binlog.000014</td>
<td class="org-right">219</td>
<td class="org-left">Query</td>
<td class="org-right">1</td>
<td class="org-right">419</td>
<td class="org-left">use `test01`; create table author (\n  id int auto_increment primary key,\n  name varchar(128) not null,\n  age int,\n  gender varchar(32)\n)</td>
</tr>

<tr>
<td class="org-left">binlog.000014</td>
<td class="org-right">419</td>
<td class="org-left">Anonymous_Gtid</td>
<td class="org-right">1</td>
<td class="org-right">484</td>
<td class="org-left">SET @@SESSION.GTID_NEXT= 'ANONYMOUS'</td>
</tr>

<tr>
<td class="org-left">binlog.000014</td>
<td class="org-right">484</td>
<td class="org-left">Query</td>
<td class="org-right">1</td>
<td class="org-right">558</td>
<td class="org-left">BEGIN</td>
</tr>

<tr>
<td class="org-left">binlog.000014</td>
<td class="org-right">558</td>
<td class="org-left">Table_map</td>
<td class="org-right">1</td>
<td class="org-right">616</td>
<td class="org-left">table_id: 112 (test01.author)</td>
</tr>

<tr>
<td class="org-left">binlog.000014</td>
<td class="org-right">616</td>
<td class="org-left">Write_rows</td>
<td class="org-right">1</td>
<td class="org-right">667</td>
<td class="org-left">table_id: 112 flags: STMT_END_F</td>
</tr>

<tr>
<td class="org-left">binlog.000014</td>
<td class="org-right">667</td>
<td class="org-left">Xid</td>
<td class="org-right">1</td>
<td class="org-right">698</td>
<td class="org-left">COMMIT <i>* xid=13 *</i></td>
</tr>

<tr>
<td class="org-left">binlog.000014</td>
<td class="org-right">698</td>
<td class="org-left">Anonymous_Gtid</td>
<td class="org-right">1</td>
<td class="org-right">763</td>
<td class="org-left">SET @@SESSION.GTID_NEXT= 'ANONYMOUS'</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2021-07-03 Sat 15:01. Created by Jinghui Hu at 2021-07-03 Sat 14:50.</p>
</div>
</body>
</html>
